Repository: Muhammad2Hegazy/Smart_sales
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Please enter category name
ar: الرجاء إدخال اسم الفئة

source: Please enter material name
ar: يرجى إدخال اسم المادة

# pleaseEnterPassword
source: Please enter your password
ar: يرجى إدخال كلمة المرور

source: Please enter sub category name
ar: الرجاء إدخال اسم الفئة الفرعية

# pleaseEnterUsername
source: Please enter your username
ar: يرجى إدخال اسم المستخدم

source: Please enter username and password
ar: يرجى إدخال اسم المستخدم وكلمة المرور

# pleaseEnterValidDeliveryTaxRate
source: Please enter a valid delivery tax rate (0-100)
ar: يرجى إدخال معدل ضريبة التوصيل صحيح (0-100)

# pleaseEnterValidHospitalityTaxRate
source: Please enter a valid hospitality tax rate (0-100)
ar: يرجى إدخال معدل ضريبة الضيافة صحيح (0-100)

# pleaseEnterValidQuantity
source: Please enter a valid quantity
ar: يرجى إدخال كمية صحيحة

# pleaseEnterValidServiceChargeRate
source: Please enter a valid service charge rate (0-100)
ar: يرجى إدخال معدل رسوم الخدمة صحيح (0-100)

# pleaseEnterValidVatRate
source: Please enter a valid VAT rate (0-100)
ar: يرجى إدخال معدل ضريبة القيمة المضافة صحيح (0-100)

# pleaseSelectItem
source: Please select an item
ar: يرجى اختيار عنصر

# pleaseSelectUser
source: Please select a user
ar: يرجى اختيار مستخدم

source: Point of Sale
ar: نقطة البيع

source: Portrait
ar: عمودي

source: POS
ar: نقطة البيع

source: Previous Balance
ar: الرصيد السابق

source: Price
ar: السعر

source: Print Customer Invoice
ar: طباعة فاتورة العميل

source: Print Kitchen Invoice
ar: طباعة فاتورة المطبخ

# printerConfigurationFailed
source: Failed to configure printer
ar: فشل تكوين الطابعة

# printerConfigured
source: Printer configured successfully
ar: تم تكوين الطابعة بنجاح

source: Printer Name
ar: اسم الطابعة

source: Printer Settings
ar: إعدادات الطابعة

source: Printing customer invoice...
ar: جاري طباعة فاتورة العميل...

source: Printing kitchen invoice...
ar: جاري طباعة فاتورة المطبخ...

source: Process Payment
ar: معالجة الدفع

source: Profit & Loss
ar: الأرباح والخسائر

# profitReportForPeriod
source: Profit Report for a Period
ar: تقرير الارباح عن فترة

source: Promote
ar: ترقية

source: Promote to Admin
ar: ترقية إلى مدير

source: Quantity
ar: الكمية

source: Raw Materials Management
ar: إدارة المواد الخام

# receiptDescription
source: Customize receipt template
ar: تخصيص قالب الفاتورة

source: Receipt Settings
ar: إعدادات الفواتير

source: Refresh
ar: تحديث

source: Reports
ar: التقارير

source: Required
ar: مطلوب

source: Reset
ar: إعادة تعيين

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: Restore
ar: استعادة

source: Restore Complete
ar: اكتملت الاستعادة

source: Restore from Backup
ar: الاستعادة من النسخة الاحتياطية

source: Role
ar: الدور

# roleRequired
source: Role is required
ar: الدور مطلوب

# saleRecorded
source: Sale recorded successfully
ar: تم تسجيل البيع بنجاح

# saleRecordedButPrintFailed
source: Sale recorded but printing failed
ar: تم تسجيل البيع ولكن فشلت الطباعة

source: Sales
ar: المبيعات

source: Sales Count
ar: عدد المبيعات

source: Sales from Date
ar: المبيعات من تاريخ

source: Sales Invoice
ar: فاتورة مبيعات

source: Sales Report
ar: تقرير المبيعات

source: Sales Report by Category
ar: تقرير مبيعات عن فئة

source: Sales Report by Item
ar: تقرير مبيعات صنف

# salesReportForCustomer
source: Sales Report for a Customer
ar: تقرير مبيعات لعميل

source: Save
ar: حفظ

source: Search
ar: بحث

source: Search Products
ar: البحث عن المنتجات

source: Second Floor
ar: الدور الثاني

source: Select Backup Database File
ar: اختر ملف قاعدة البيانات الاحتياطي

source: Select Category
ar: اختر الفئة

source: Select Date
ar: اختر التاريخ

# selectDeviceAndFloor
source: Select device and assign floor number
ar: اختر الجهاز وعيّن رقم الدور

source: Select Item
ar: اختر العنصر

source: Select Period
ar: اختر الفترة

# selectPermissionsForUser
source: Select permissions for this user:
ar: اختر الصلاحيات لهذا المستخدم:

source: Select Sub Category
ar: اختر الفئة الفرعية

source: Select Table
ar: اختر الطاولة

source: Select User
ar: اختر المستخدم

# selectUserAndEnterPassword
source: Select a user and enter password
ar: اختر مستخدم وأدخل كلمة المرور

source: Service
ar: خدمة

source: Set as Master
ar: تعيين كجهاز رئيسي

source: Settings
ar: الإعدادات

source: Settings saved successfully
ar: تم حفظ الإعدادات بنجاح

source: Shift Closing Report
ar: تقرير تقفيل الوردية

source: Show
ar: عرض

source: Sign In
ar: تسجيل الدخول

source: Sign in to continue
ar: سجل الدخول للمتابعة

source: Sign Out
ar: تسجيل الخروج

# signOutFromAccount
source: Sign out from your account
ar: تسجيل الخروج من حسابك

# soundDescription
source: Play sound for transactions
ar: تشغيل الصوت للمعاملات

source: Sound Effects
ar: الأصوات

source: Stock Status
ar: حالة المخزون

# stockUpdated
source: Stock updated successfully
ar: تم تحديث المخزون بنجاح

source: Sub Categories
ar: الفئات الفرعية

source: Sub Category
ar: الفئة الفرعية

source: Summary
ar: ملخص

source: Supplier Account Statement
ar: كشف حساب المورد

source: Supplier Balances Report
ar: تقرير ارصدة الموردين

source: Supplier Purchases Report
ar: تقرير مشتريات مورد

source: Supplies to Sub-treasury
ar: توريدات للخزينة الفرعيه

source: Sync
ar: المزامنة

source: Sync Now
ar: مزامنة الآن

# syncRequiresSupabase
source: Sync requires Supabase configuration for data synchronization
ar: تتطلب المزامنة تكوين Supabase لمزامنة البيانات

source: Sync service not available
ar: خدمة المزامنة غير متاحة

source: Sync Status
ar: حالة المزامنة

source: Sync status unavailable
ar: حالة المزامنة غير متاحة

source: System
ar: النظام

# systemSettings
source: System
ar: النظام

source: Table
ar: طاولة

source: Table Number
ar: رقم الطاولة

source: Tables
ar: طاولات

source: Takeaway
ar: طلب خارجي

# taxDescription
source: Configure tax rates and rules
ar: تكوين معدلات وقواعد الضرائب

source: Tax Settings
ar: إعدادات الضرائب

source: Theme
ar: المظهر

source: Third Floor
ar: الدور الثالث

source: This Month
ar: هذا الشهر

source: This Week
ar: هذا الأسبوع

source: This Year
ar: هذا العام

source: Time
ar: الوقت

source: To
ar: إلى

source: To Date
ar: إلى تاريخ

source: Today
ar: اليوم

source: Total
ar: الإجمالي

source: Total by Category
ar: اجمالي الفئه

source: Total by Type
ar: اجمالي النوع

source: Total Cash In
ar: إجمالي الإيداعات

source: Total Cash Out
ar: إجمالي السحوبات

source: Total Count
ar: اجمالي العدد

source: Total Discount
ar: اجمالي الخصم

source: Total Invoice
ar: اجمالي الفاتورة

source: Total Items
ar: إجمالي العناصر

source: Total Payments
ar: اجمالي المدفوعات

source: Total Quantity Sold
ar: اجمالي الكميه المباعه

source: Total Receipts
ar: اجمالي المقبوضات

source: Total Sales
ar: إجمالي المبيعات

source: Total Value
ar: اجمالي القيمه

# transactionAdded
source: Transaction added successfully
ar: تمت إضافة المعاملة بنجاح

source: Transaction Details
ar: تفاصيل المعاملة

source: Transaction Type
ar: نوع المعاملة

source: Transactions
ar: المعاملات

source: Unit:
ar: الوحدة:

source: Unknown
ar: غير معروف

source: Unknown state
ar: حالة غير معروفة

source: User
ar: المستخدم

source: User created successfully
ar: تم إنشاء المستخدم بنجاح

source: User Management
ar: إدارة المستخدمين

source: Username
ar: اسم المستخدم

# usernameRequired
source: Username is required
ar: اسم المستخدم مطلوب

source: Users
ar: المستخدمون

source: Value
ar: القيمة

source: Value Added Tax
ar: ضریبه قیمه مضافه

source: View Details
ar: عرض التفاصيل

source: Visa
ar: فيزا

source: Waiter
ar: ويتر

source: Warehouse Movement Report
ar: تقرير المخزن عن حركة

source: Warehouses
ar: المخازن

source: Weekly Report
ar: التقرير الأسبوعي

source: Welcome
ar: اهلا بكم

source: Yearly Report
ar: التقرير السنوي

source: Expiry Date
ar: تاريخ الصلاحية

source: Edit Material
ar: تعديل المادة

source: Add Batch
ar: إضافة دفعة

source: Batch Expiry Date
ar: تاريخ صلاحية الدفعة

source: Material Quantity
ar: كمية المادة

source: Material Unit
ar: وحدة المادة

source: Please enter quantity
ar: يرجى إدخال الكمية

source: Please select expiry date
ar: يرجى اختيار تاريخ الصلاحية

source: Batch added successfully
ar: تمت إضافة الدفعة بنجاح

source: Batch updated successfully
ar: تم تحديث الدفعة بنجاح

# materialNameColumn
source: Material Name
ar: اسم المادة

# quantityColumn
source: Quantity
ar: الكمية

# expiryDateColumn
source: Expiry Date
ar: تاريخ الصلاحية

source: Recipe
ar: الوصفة

source: Recipe Management
ar: إدارة الوصفات

source: Manage Recipe
ar: إدارة الوصفة

source: Recipe Ingredients
ar: مكونات الوصفة

source: Add Ingredient
ar: إضافة مكون

source: Select Raw Material
ar: اختر المادة الخام

source: Ingredient Quantity
ar: كمية المكون

source: Please select raw material
ar: يرجى اختيار المادة الخام

source: Please enter ingredient quantity
ar: يرجى إدخال كمية المكون

source: Ingredient added successfully
ar: تمت إضافة المكون بنجاح

source: Ingredient updated successfully
ar: تم تحديث المكون بنجاح

source: Ingredient deleted successfully
ar: تم حذف المكون بنجاح

source: Recipe created successfully
ar: تم إنشاء الوصفة بنجاح

source: Recipe updated successfully
ar: تم تحديث الوصفة بنجاح

# noRecipeFound
source: No recipe found for this product
ar: لا توجد وصفة لهذا المنتج

source: Create Recipe
ar: إنشاء وصفة

source: Edit Ingredient
ar: تعديل المكون

source: Delete Ingredient
ar: حذف المكون
