Repository: Muhammad2Hegazy/Smart_sales
Catalog: lib/l10n/app_*.arb
Languages: ar

source: About
ar: حول

# aboutDescription
source: App version and information
ar: إصدار التطبيق والمعلومات

source: Account
ar: الحساب

source: Account Balances Report
ar: تقرير ارصدة الحسابات

source: Accounts
ar: الحسابات

source: Action
ar: إجراء

source: Add Cash In
ar: إضافة إيداع نقدي

source: Add Cash Out
ar: إضافة سحب نقدي

source: Add Device
ar: إضافة جهاز

source: Add Item
ar: إضافة عنصر

# addItemsOrImport
source: Add items or import from Excel
ar: إضافة عناصر أو استيراد من Excel

source: Add New Item
ar: إضافة عنصر جديد

source: Add New Material
ar: إضافة مادة خام جديدة

# addNewRawMaterialsToInventory
source: Add new raw materials to your inventory
ar: إضافة مواد خام جديدة إلى المخزون

source: Add Stock
ar: إضافة مخزون

source: Add Transaction
ar: إضافة معاملة

source: Add User
ar: إضافة مستخدم

source: All
ar: الكل

source: All data cleared
ar: تم مسح جميع البيانات

source: All devices deleted successfully
ar: تم حذف جميع الأجهزة بنجاح

source: All synced
ar: تمت المزامنة بالكامل

source: Allow Printing
ar: السماح بالطباعة

source: Amount
ar: المبلغ

# appTitle
source: Smart Sales POS
ar: نقاط البيع الذكية

source: Appearance
ar: المظهر

source: Arabic
ar: العربية

# areYouSureDeleteAllDevices
source: Are you sure you want to delete all devices except the current one?
ar: هل أنت متأكد أنك تريد حذف جميع الأجهزة باستثناء الجهاز الحالي؟

# areYouSureDeleteDevice
source: Are you sure you want to delete this device?
ar: هل أنت متأكد أنك تريد حذف هذا الجهاز؟

# areYouSurePromoteToAdmin
source: Are you sure you want to promote "{username}" to admin?
ar: هل أنت متأكد أنك تريد ترقية "{username}" إلى مدير؟

# areYouSureSignOut
source: Are you sure you want to sign out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

# autoPrintDescription
source: Automatically print receipts after payment
ar: طباعة الفواتير تلقائياً بعد الدفع

source: Auto Print Receipts
ar: طباعة الفواتير تلقائياً

source: Average Sale
ar: متوسط البيع

source: Average Selling Price
ar: متوسط سعر البيع

# backupCreated
source: Backup created successfully
ar: تم إنشاء النسخة الاحتياطية بنجاح

# backupDescription
source: Backup or restore your data
ar: النسخ الاحتياطي أو استعادة بياناتك

source: Backup file not found
ar: لم يتم العثور على ملف النسخة الاحتياطية

source: Backup & Restore
ar: النسخ الاحتياطي والاستعادة

source: Balance
ar: الرصيد

source: Barcode
ar: باركود

source: Business Settings
ar: إعدادات العمل

source: Cancel
ar: إلغاء

source: Card
ar: بطاقة

source: Cart
ar: السلة

# cartEmpty
source: Cart is empty
ar: السلة فارغة

source: Cash
ar: نقدي

source: Cash In
ar: إيداع نقدي

source: Cash Out
ar: سحب نقدي

source: Cash Sales
ar: مبيعات نقدی

source: Cashier
ar: الكاشير

source: Categories
ar: الفئات

source: Category
ar: الفئة

source: Change Password
ar: تغيير كلمة المرور

# changePasswordForUser
source: Change Password for {username}
ar: تغيير كلمة المرور لـ {username}

source: Choose user
ar: اختر المستخدم

source: Clear All Data
ar: مسح جميع البيانات

source: Clear Cart
ar: مسح السلة

# clearDataDescription
source: Permanently delete all data
ar: حذف جميع البيانات بشكل دائم

# clearDataWarning
source: This action cannot be undone. All your data will be permanently deleted.
ar: لا يمكن التراجع عن هذا الإجراء. سيتم حذف جميع بياناتك بشكل دائم.

source: Close
ar: إغلاق

source: Configure Printer
ar: تكوين الطابعة

source: Confirm new password
ar: تأكيد كلمة المرور الجديدة

source: Confirm Password
ar: تأكيد كلمة المرور

source: Consolidated Sales Report
ar: تقرير مجمع للمبيعات

# continuousPaper
source: Continuous (leave empty)
ar: ورق مستمر (اتركه فارغاً)

source: Conversion Rate
ar: معادلة التحويل

# copyright
source: Â© 2024 Smart Sales. All rights reserved.
ar: © 2024 Smart Sales. جميع الحقوق محفوظة.

source: Cost of Sales
ar: تكلفة المبيعات

source: Create Backup
ar: إنشاء نسخة احتياطية

source: Create New Category
ar: إنشاء فئة جديدة

source: Create New Sub Category
ar: إنشاء فئة فرعية جديدة

source: Create New User
ar: إنشاء مستخدم جديد

# createNewUserAccount
source: Create a new user account
ar: إنشاء حساب مستخدم جديد

# creditSales
source: Credit Sales and Revenues
ar: مبيعات وایرادات اجل

source: Currency
ar: العملة

source: Current
ar: الحالي

source: Custom Role
ar: دور مخصص

source: Customer
ar: العميل

source: Customer Account Statement
ar: كشف حساب العميل

source: Customer Balances Report
ar: تقرير ارصدة العملاء

# customerInvoicePrinted
source: Customer invoice printed successfully
ar: تم طباعة فاتورة العميل بنجاح

source: Daily Report
ar: التقرير اليومي

source: Daily Sales Report
ar: تقرير المبيعات اليومي

source: Danger Zone
ar: المنطقة الخطرة

source: Dark
ar: داكن

source: Data Import
ar: استيراد البيانات

source: Database restored successfully
ar: تم استعادة قاعدة البيانات بنجاح

source: Date
ar: التاريخ

source: Delete All Devices
ar: حذف جميع الأجهزة

# deleteAllDevicesDescription
source: Delete all devices except the current one
ar: حذف جميع الأجهزة باستثناء الجهاز الحالي

source: Delete Device
ar: حذف الجهاز

source: Delivery
ar: توصيل

source: Delivery Service
ar: خدمه توصیل

# demoCredentials
source: Demo: Enter any username and password
ar: تجريبي: أدخل أي اسم مستخدم وكلمة مرور

source: Description
ar: الوصف

# deviceDeletedLogout
source: This device has been removed. You will be logged out.
ar: تم إزالة هذا الجهاز. سيتم تسجيل الخروج.

source: Device deleted successfully
ar: تم حذف الجهاز بنجاح

source: Device Management
ar: إدارة الأجهزة

source: Device Name
ar: اسم الجهاز

# deviceNotAuthorized
source: Device not authorized. Please contact administrator to register this device.
ar: الجهاز غير مصرح به. يرجى الاتصال بالمسؤول لتسجيل هذا الجهاز.

source: Device set as master successfully
ar: تم تعيين الجهاز كجهاز رئيسي بنجاح

source: Devices
ar: الأجهزة

source: Dine-in Service
ar: خدمه صاله

source: Discount
ar: خصم

source: each
ar: لكل

source: Edit
ar: تعديل

source: Edit Item
ar: تعديل العنصر

source: Edit Master Name
ar: تعديل اسم الجهاز الرئيسي

source: Enable Notifications
ar: تفعيل الإشعارات

source: English
ar: الإنجليزية

source: Enter amount
ar: أدخل المبلغ

source: Enter category name
ar: أدخل اسم الفئة

# enterConversionRate
source: Enter conversion rate (e.g., 1 kg = 80 cups, enter 80)
ar: أدخل معادلة التحويل (مثال: 1 كجم = 80 كوب، أدخل 80)

source: Enter Custom Role
ar: أدخل الدور المخصص

source: Enter description
ar: أدخل الوصف

source: Enter device name
ar: أدخل اسم الجهاز

source: Enter item name
ar: أدخل اسم العنصر

source: Enter MAC Address
ar: أدخل عنوان MAC

source: Enter material name
ar: أدخل اسم المادة

source: Enter new password
ar: أدخل كلمة المرور الجديدة

# enterPassword
source: Enter your password
ar: أدخل كلمة المرور

source: Enter price
ar: أدخل السعر

source: Enter Quantity
ar: أدخل الكمية

source: Enter sub category name
ar: أدخل اسم الفئة الفرعية

# enterUsername
source: Enter your username
ar: أدخل اسم المستخدم

source: Error adding item
ar: خطأ في إضافة العنصر

# errorAddingMaterial
source: Error adding material: {error}
ar: خطأ في إضافة المادة: {error}

# errorChangingPassword
source: Error changing password: {error}
ar: خطأ في تغيير كلمة المرور: {error}

# errorLoadingUsers
source: Error loading users: {error}
ar: خطأ في تحميل المستخدمين: {error}

source: Error printing customer invoice
ar: خطأ في طباعة فاتورة العميل

source: Error printing kitchen invoice
ar: خطأ في طباعة فاتورة المطبخ

# errorResettingPassword
source: Error resetting password: {error}
ar: خطأ في إعادة تعيين كلمة المرور: {error}

# errorRestoringBackup
source: Error restoring backup: {error}
ar: خطأ في استعادة النسخة الاحتياطية: {error}

source: Error updating stock
ar: خطأ في تحديث المخزون

source: Expenses
ar: المصروفات

source: Expenses and Purchases
ar: مصروفات ومشتريات

source: Export
ar: تصدير

source: Failed to get file path
ar: فشل الحصول على مسار الملف

source: Failed to save settings
ar: فشل حفظ الإعدادات

source: Filter
ar: تصفية

source: Financial Report
ar: التقرير المالي

source: Floor
ar: الدور

source: Floors updated successfully
ar: تم تحديث الأدوار بنجاح

source: Forgot Password
ar: نسيت كلمة المرور

source: From
ar: من

source: From Date
ar: من تاريخ

source: General Ledger Report
ar: تقرير حساب الاستاذ

source: General Settings
ar: الإعدادات العامة

source: Get MAC Address
ar: الحصول على عنوان MAC

source: Grand Totals
ar: الأجماليات

source: Ground Floor
ar: المرسى

source: Has Notes
ar: يحتوي على ملاحظات

source: Hospitality Table
ar: طاولة الضيافة

source: ID
ar: المعرف

source: Import Categories
ar: استيراد الفئات

source: Import from Excel
ar: استيراد من Excel

# importItems
source: Import Items (Required)
ar: استيراد العناصر (مطلوب)

# importItemsButton
source: Import Items
ar: استيراد العناصر

source: Import Notes
ar: استيراد الملاحظات

source: Import Raw Materials
ar: استيراد المواد الخام

# importRawMaterialsFromExcel
source: You can also import raw materials from Excel in the Settings screen
ar: يمكنك أيضاً استيراد المواد الخام من Excel في شاشة الإعدادات

source: Import Sub Categories
ar: استيراد الفئات الفرعية

source: In Stock
ar: متوفر

source: Income
ar: الدخل

source: Income Statement Report
ar: تقرير قائمة الدخل

source: Invalid number
ar: رقم غير صحيح

source: Inventory
ar: المخزون

source: Inventory Count
ar: جرد المخزن

source: Inventory Count by Category
ar: جرد المخزن عن فئة

source: Invoice
ar: فاتورة

source: Invoice Number
ar: فاتورة رقم

source: Item
ar: الصنف

# itemAdded
source: Item added successfully
ar: تمت إضافة العنصر بنجاح

source: Item by Movement Report
ar: تقرير صنف عن حركة

source: Item Movement Report
ar: تقرير حركة صنف

source: Item Name
ar: اسم العنصر

# itemUpdated
source: Item updated successfully
ar: تم تحديث العنصر بنجاح

source: Itemized Sales
ar: الأصناف المباعة

source: Items
ar: العناصر

# itemsImportedSuccessfully
source: Items imported successfully ({count} items). These items are available in POS only.
ar: تم استيراد العناصر بنجاح ({count} عنصر). هذه العناصر متاحة في نقطة البيع فقط.

source: Just now
ar: الآن

# kitchenInvoicePrinted
source: Kitchen invoice printed successfully
ar: تم طباعة فاتورة المطبخ بنجاح

source: Landscape
ar: أفقي

source: Language
ar: اللغة

# lastSync
source: Last sync: {time}
ar: آخر مزامنة: {time}

# leaveEmptyForContinuous
source: Leave empty for continuous paper
ar: اتركه فارغاً للورق المستمر

source: Light
ar: فاتح

source: Loading devices...
ar: جاري تحميل الأجهزة...

source: Loading profile...
ar: جاري تحميل الملف الشخصي...

source: Logout
ar: تسجيل الخروج

# logoutConfirm
source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Low Stock
ar: مخزون منخفض

# lowStockLabel
source: Low Stock
ar: مخزون منخفض

source: MAC Address
ar: عنوان MAC

# macAddressRequired
source: MAC address is required
ar: عنوان MAC مطلوب

source: Manage Device Floors
ar: إدارة أدوار الأجهزة

# manageDeviceFloorsDescription
source: Assign devices to floors
ar: تعيين الأجهزة على الأدوار

source: Manage Permissions
ar: إدارة الصلاحيات

source: Master Device
ar: الجهاز الرئيسي

# masterDeviceId
source: Master Device ID: {id}...
ar: معرف الجهاز الرئيسي: {id}...

source: Master Name
ar: اسم الجهاز الرئيسي

source: Material added successfully
ar: تمت إضافة المادة بنجاح

source: Material Name
ar: اسم المادة

source: Method
ar: الطريقة

# modernPointOfSaleSystem
source: A modern Point of Sale system for Windows.
ar: نظام نقاط البيع الحديث لنظام Windows.

source: Monthly Report
ar: التقرير الشهري

source: Name
ar: الاسم

source: Net Cash
ar: صافي النقدية

source: Net Invoice
ar: صافي الفاتورة

source: Net Loss
ar: صافي الخسارة

# netMovementForDay
source: Net Movement for the Day
ar: صافي حركة اليوم

source: Net Profit
ar: صافي الربح

source: Net Sales
ar: صافي المبيعات

source: New Category Name
ar: اسم الفئة الجديدة

source: New Password
ar: كلمة المرور الجديدة

source: New Sub Category Name
ar: اسم الفئة الفرعية الجديدة

# noCategories
source: No categories. Import from Excel.
ar: لا توجد فئات. استورد من Excel.

source: No file selected
ar: لم يتم اختيار ملف

source: No Floor
ar: بدون دور

source: No items
ar: لا توجد عناصر

source: No items found
ar: لا توجد عناصر

source: No notes
ar: لا توجد ملاحظات

source: No printers available
ar: لا توجد طابعات متاحة

source: No sales found
ar: لا توجد مبيعات

source: No subcategories
ar: لا توجد فئات فرعية

# noSubcategoriesAvailable
source: No subcategories available. Please import subcategories first.
ar: لا توجد فئات فرعية متاحة. يرجى استيراد الفئات الفرعية أولاً.

source: No transactions found
ar: لا توجد معاملات

source: No users found
ar: لم يتم العثور على مستخدمين

source: Not authenticated
ar: غير مصادق عليه

source: Notes
ar: الملاحظات

# notificationsDescription
source: Receive notifications for important updates
ar: تلقي إشعارات للتحديثات المهمة

source: Offline
ar: غير متصل

source: OK
ar: موافق

source: Online
ar: متصل

source: Optional
ar: اختياري

source: Order Number
ar: رقم الطلب

source: Orientation
ar: الاتجاه

source: Other Revenues
ar: ایرادات اخرى

source: Out of Stock
ar: نفد المخزون

source: Paper Height
ar: ارتفاع الورق

source: Paper Size
ar: حجم الورق

source: Paper Source
ar: مصدر الورق

source: Paper Width
ar: عرض الورق

source: Password
ar: كلمة المرور

source: Password changed successfully
ar: تم تغيير كلمة المرور بنجاح

# passwordMinLength
source: Password must be at least 5 characters
ar: يجب أن تكون كلمة المرور 5 أحرف على الأقل

# passwordRequired
source: Password is required
ar: كلمة المرور مطلوبة

source: Password reset successfully
ar: تم إعادة تعيين كلمة المرور بنجاح

source: Passwords do not match
ar: كلمات المرور غير متطابقة

source: Pay
ar: دفع

source: Payment
ar: الدفع

# paymentMethod
source: Select Payment Method:
ar: اختر طريقة الدفع:

# paymentProcessed
source: Payment processed via {method}
ar: تم معالجة الدفع عبر {method}

source: Period
ar: الفترة

# permissionAccessDeviceManagement
source: Access Device Management
ar: الوصول إلى إدارة الأجهزة

# permissionAccessFinancialScreen
source: Access Financial Screen
ar: الوصول إلى الشاشة المالية

# permissionAccessGeneralSettings
source: Access General Settings
ar: الوصول إلى الإعدادات العامة

# permissionAccessInventoryScreen
source: Access Inventory Screen
ar: الوصول إلى شاشة المخزون

# permissionAccessItemsScreen
source: Access Items Screen
ar: الوصول إلى شاشة العناصر

# permissionAccessPosScreen
source: Access POS Screen
ar: الوصول إلى شاشة نقطة البيع

# permissionAccessReportsScreen
source: Access Reports Screen
ar: الوصول إلى شاشة التقارير

# permissionAccessSettingsScreen
source: Access Settings Screen
ar: الوصول إلى شاشة الإعدادات

# permissionAccessSyncSettings
source: Access Sync Settings
ar: الوصول إلى إعدادات المزامنة

# permissionAccessSystemSettings
source: Access System Settings
ar: الوصول إلى إعدادات النظام

# permissionAccessUserManagement
source: Access User Management
ar: الوصول إلى إدارة المستخدمين

# permissionAccountBalancesReport
source: Account Balances Report
ar: تقرير أرصدة الحسابات

# permissionAddEditItemsProducts
source: Add/Edit Items/Products
ar: إضافة/تعديل العناصر/المنتجات

# permissionAddNewAccount
source: Add New Account
ar: إضافة حساب جديد

# permissionAddVendors
source: Add Vendors
ar: إضافة موردين

# permissionAdjustSalePrice
source: Adjust Sale Price
ar: تعديل سعر البيع

# permissionAggregatedSalesReportByItems
source: Aggregated Sales Report By Items
ar: تقرير المبيعات المجمع حسب العناصر

# permissionBasicData
source: Basic Data
ar: البيانات الأساسية

# permissionChangeItemCurrentInvoice
source: Change Item Current Invoice
ar: تغيير عنصر الفاتورة الحالية

# permissionChangeItemQuantityLess
source: Change Item Quantity Less
ar: تغيير كمية العنصر أقل

# permissionClearAllCurrentInvoice
source: Clear All Current Invoice
ar: مسح جميع الفاتورة الحالية

# permissionClearItemCurrentInvoice
source: Clear Item Current Invoice
ar: مسح عنصر الفاتورة الحالية

# permissionCustomerAccountStatement
source: Customer Account Statement
ar: كشف حساب العميل

# permissionCustomerBalancesReport
source: Customer Balances Report
ar: تقرير أرصدة العملاء

# permissionDailySalesReport
source: Daily Sales Report
ar: تقرير المبيعات اليومي

# permissionDiscountInvoiceItems
source: Discount Invoice Items
ar: خصم عناصر الفاتورة

# permissionFinancialAddCashIn
source: Financial: Add Cash In
ar: المالية: إضافة إيداع نقدي

# permissionFinancialAddCashOut
source: Financial: Add Cash Out
ar: المالية: إضافة سحب نقدي

# permissionFinancialCalculateProfitLoss
source: Financial: Calculate Profit/Loss
ar: المالية: حساب الأرباح/الخسائر

# permissionFinancialViewProfitLoss
source: Financial: View Profit/Loss
ar: المالية: عرض الأرباح/الخسائر

# permissionFinancialViewTransactions
source: Financial: View Transactions
ar: المالية: عرض المعاملات

# permissionGeneralLedgerReport
source: General Ledger Report
ar: تقرير حساب الأستاذ

# permissionIncomeStatementReport
source: Income Statement Report
ar: تقرير قائمة الدخل

# permissionInquireTreasuryBalance
source: Inquire Treasury Balance
ar: الاستعلام عن رصيد الخزينة

# permissionInventoryCountReport
source: Inventory Count Report
ar: تقرير جرد المخزون

# permissionInventoryCountReportByCategory
source: Inventory Count Report By Category
ar: تقرير جرد المخزون حسب الفئة

# permissionInventoryMovementReport
source: Inventory Movement Report
ar: تقرير حركة المخزون

# permissionItemMovementReport
source: Item Movement Report
ar: تقرير حركة العنصر

# permissionItemMovementReportByItem
source: Item Movement Report By Item
ar: تقرير حركة العنصر حسب العنصر

# permissionModuleAccountReports
source: Account Reports
ar: تقارير الحسابات

# permissionModuleAccounts
source: Accounts
ar: الحسابات

# permissionModuleBasicData
source: Basic Data
ar: البيانات الأساسية

# permissionModuleFinancialFeatures
source: Financial Features
ar: الميزات المالية

# permissionModuleInventory
source: Inventory
ar: المخزون

# permissionModuleInventoryReports
source: Inventory Reports
ar: تقارير المخزون

# permissionModuleMainScreens
source: Main Screens
ar: الشاشات الرئيسية

# permissionModulePermissions
source: Permissions
ar: الصلاحيات

# permissionModulePosFeatures
source: POS Features
ar: ميزات نقطة البيع

# permissionModulePurchaseReports
source: Purchase Reports
ar: تقارير المشتريات

# permissionModulePurchases
source: Purchases
ar: المشتريات

# permissionModuleReportsFeatures
source: Reports Features
ar: ميزات التقارير

# permissionModuleSalesInvoice
source: Sales Invoice
ar: فاتورة المبيعات

# permissionModuleSalesReports
source: Sales Reports
ar: تقارير المبيعات

# permissionModuleSalesReturns
source: Sales Returns
ar: مرتجعات المبيعات

# permissionModuleSettingsFeatures
source: Settings Features
ar: ميزات الإعدادات

# permissionModuleSettingsTabs
source: Settings Tabs
ar: تبويبات الإعدادات

# permissionModuleVendors
source: Vendors
ar: الموردون

# permissionPosAccessHospitalityTable
source: POS: Access Hospitality Table
ar: نقطة البيع: الوصول إلى طاولة الضيافة

# permissionPosApplyDiscount
source: POS: Apply Discount
ar: نقطة البيع: تطبيق الخصم

# permissionPosClearCart
source: POS: Clear Cart
ar: نقطة البيع: مسح السلة

# permissionPosPrintInvoice
source: POS: Print Invoice
ar: نقطة البيع: طباعة الفاتورة

# permissionPosProcessPayment
source: POS: Process Payment
ar: نقطة البيع: معالجة الدفع

# permissionPosSelectTable
source: POS: Select Table
ar: نقطة البيع: اختيار الطاولة

# permissionPosViewCart
source: POS: View Cart
ar: نقطة البيع: عرض السلة

# permissionPrintBarcode
source: Print Barcode
ar: طباعة الباركود

# permissionProfitReportForPeriod
source: Profit Report For Period
ar: تقرير الأرباح للفترة

# permissionPurchaseReportByVendor
source: Purchase Report By Vendor
ar: تقرير المشتريات حسب المورد

# permissionRegisterAdjustmentEntries
source: Register Adjustment Entries
ar: تسجيل قيود التسوية

# permissionRegisterCashDisbursement
source: Register Cash Disbursement
ar: تسجيل صرف نقدي

# permissionRegisterCashReceipt
source: Register Cash Receipt
ar: تسجيل إيصال نقدي

# permissionRegisterOpeningBalance
source: Register Opening Balance
ar: تسجيل الرصيد الافتتاحي

# permissionRegisterPurchaseInvoice
source: Register Purchase Invoice
ar: تسجيل فاتورة الشراء

# permissionRegisterPurchaseReturns
source: Register Purchase Returns
ar: تسجيل مرتجعات الشراء

# permissionRegisterSalesInvoice
source: Register Sales Invoice
ar: تسجيل فاتورة المبيعات

# permissionRegisterSalesReturns
source: Register Sales Returns
ar: تسجيل مرتجعات المبيعات

# permissionRegisterTransfersFromWarehouses
source: Register Transfers From Warehouses
ar: تسجيل التحويلات من المخازن

# permissionRegisterTransfersToWarehouses
source: Register Transfers To Warehouses
ar: تسجيل التحويلات إلى المخازن

# permissionReportsExportReports
source: Reports: Export Reports
ar: التقارير: تصدير التقارير

# permissionReportsViewDailyReport
source: Reports: View Daily Report
ar: التقارير: عرض التقرير اليومي

# permissionReportsViewFinancialReport
source: Reports: View Financial Report
ar: التقارير: عرض التقرير المالي

# permissionReportsViewMonthlyReport
source: Reports: View Monthly Report
ar: التقارير: عرض التقرير الشهري

# permissionReportsViewSalesReport
source: Reports: View Sales Report
ar: التقارير: عرض تقرير المبيعات

# permissionReportsViewWeeklyReport
source: Reports: View Weekly Report
ar: التقارير: عرض التقرير الأسبوعي

# permissionReportsViewYearlyReport
source: Reports: View Yearly Report
ar: التقارير: عرض التقرير السنوي

# permissionRetrieveEditOpeningBalance
source: Retrieve/Edit Opening Balance
ar: استرجاع/تعديل الرصيد الافتتاحي

# permissionRetrieveEditPurchaseInvoice
source: Retrieve/Edit Purchase Invoice
ar: استرجاع/تعديل فاتورة الشراء

# permissionRetrieveEditSalesInvoice
source: Retrieve/Edit Sales Invoice
ar: استرجاع/تعديل فاتورة المبيعات

# permissionSalesReportByCategory
source: Sales Report By Category
ar: تقرير المبيعات حسب الفئة

# permissionSalesReportByCustomer
source: Sales Report By Customer
ar: تقرير المبيعات حسب العميل

# permissionSalesReportByItem
source: Sales Report By Item
ar: تقرير المبيعات حسب العنصر

# permissionSettingsBackupRestore
source: Settings: Backup/Restore
ar: الإعدادات: النسخ الاحتياطي/الاستعادة

# permissionSettingsChangePassword
source: Settings: Change Password
ar: الإعدادات: تغيير كلمة المرور

# permissionSettingsClearData
source: Settings: Clear Data
ar: الإعدادات: مسح البيانات

# permissionSettingsConfigurePrinter
source: Settings: Configure Printer
ar: الإعدادات: تكوين الطابعة

# permissionSettingsConfigureTax
source: Settings: Configure Tax
ar: الإعدادات: تكوين الضرائب

# permissionSettingsCreateUser
source: Settings: Create User
ar: الإعدادات: إنشاء مستخدم

# permissionSettingsDeleteUser
source: Settings: Delete User
ar: الإعدادات: حذف مستخدم

# permissionSettingsEditUser
source: Settings: Edit User
ar: الإعدادات: تعديل مستخدم

# permissionSettingsExportData
source: Settings: Export Data
ar: الإعدادات: تصدير البيانات

# permissionSettingsImportData
source: Settings: Import Data
ar: الإعدادات: استيراد البيانات

# permissionSettingsManagePermissions
source: Settings: Manage Permissions
ar: الإعدادات: إدارة الصلاحيات

# permissionShiftPreferenceReport
source: Shift Preference Report
ar: تقرير تفضيل الوردية

# permissionSupplierAccountStatement
source: Supplier Account Statement
ar: كشف حساب المورد

# permissionSupplierBalancesReport
source: Supplier Balances Report
ar: تقرير أرصدة الموردين

# permissionTemporaryPrintBeforeSave
source: Temporary Print Before Save
ar: طباعة مؤقتة قبل الحفظ

# permissionUserPermissions
source: User Permissions
ar: صلاحيات المستخدم

# permissionViewReports
source: View Reports
ar: عرض التقارير

# permissionsForUser
source: Permissions: {username}
ar: الصلاحيات: {username}

source: Permissions updated successfully
ar: تم تحديث الصلاحيات بنجاح

source: Phone
ar: الهاتف

source: Please confirm password
ar: يرجى تأكيد كلمة المرور

# pleaseCreateAccountFirst
source: Please create an account first
ar: يرجى إنشاء حساب أولاً
